#### 📖 Terraform Plan -> deploy-auth-infra

<details><summary>Clique para ver os detalhes</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-SOAT-ORG/fiap-soat-auth/runs/run-2Gk5iBSn2w7r9emx

Waiting for the plan to start...

Terraform v1.13.3
on linux_amd64
Initializing plugins and modules...
aws_iam_role.lambda_exec_role: Refreshing state... [id=auth-cpf-lambda-role]
aws_apigatewayv2_api.http_api: Refreshing state... [id=vb1d366f4e]
data.aws_caller_identity.current: Refreshing...
data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
aws_apigatewayv2_api.http_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = "vb1d366f4e"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.auth_route will be created
  + resource "aws_apigatewayv2_route" "auth_route" {
      + api_id             = "vb1d366f4e"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /auth/cpf"
      + target             = (known after apply)
    }

  # aws_iam_role.lambda_exec_role must be replaced
-/+ resource "aws_iam_role" "lambda_exec_role" {
      ~ arn                   = "arn:aws:iam::016804998405:role/auth-cpf-lambda-role" -> (known after apply)
      ~ create_date           = "2025-11-28T00:49:04Z" -> (known after apply)
      ~ id                    = "auth-cpf-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "auth-cpf-lambda-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQH2NH5UCX5YABITR6" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "auth-cpf-lambda-role"
    }

  # aws_lambda_function.auth_lambda will be created
  + resource "aws_lambda_function" "auth_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "auth-cpf-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "lambda-auth-revert-29-tech-challenge-faze3-1c03719.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_DATABASE" = "DEFINIDA_NO_TERRAFORM_CLOUD"
              + "DB_HOST"     = "DEFINIDA_NO_TERRAFORM_CLOUD"
              + "DB_PASSWORD" = "DEFINIDA_NO_TERRAFORM_CLOUD"
              + "DB_PORT"     = "5432"
              + "DB_USERNAME" = "DEFINIDA_NO_TERRAFORM_CLOUD"
              + "JWT_SECRET"  = "DEFINIDA_NO_TERRAFORM_CLOUD"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.api_gw_permission will be created
  + resource "aws_lambda_permission" "api_gw_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "auth-cpf-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = "arn:aws:execute-api:us-east-1:016804998405:vb1d366f4e/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.lambda_artifacts will be created
  + resource "aws_s3_bucket" "lambda_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "fiap-soat-lambda-code-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "Lambda Artifacts Storage"
        }
      + tags_all                    = {
          + "Name" = "Lambda Artifacts Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @GustaSchmidt, Action: `pull_request`*